# SpaceReferenceLevelParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpaceReferenceLevelParam Property
ParameterTypeId Class See Also
---
"Reference Level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpaceReferenceLevelParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpaceReferenceLevelParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpaceReferenceLevelParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace